In [1]:
#import libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot
import seaborn
import scipy

In [9]:
#import files
path = r'/Users/docopeland/04 Instacart Basket Analysis'
customers = pd.read_csv(os.path.join(path,'02 Data','original data','customers.csv'))

In [11]:
customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [17]:
#getting full names of the columns
customers.columns

Index(['user_id', 'First Name', 'Surnam', 'Gender', 'state', 'Age',
       'date_joined', 'dependenants', 'family_status', 'income'],
      dtype='object')

In [18]:
#rename the columns
customers.rename(columns = {'n_dependants':'dependants'}, inplace = True)
customers.rename(columns = {'STATE':'state'}, inplace = True)
customers.rename(columns = {'fam_status':'family_status'}, inplace = True)
#dropping the name columns as they aren't necessary 
customers = customers.drop(columns = ['First Name','Surnam'])

In [19]:
customers.head()

,user_id,Gender,state,Age,date_joined,dependenants,family_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

In [21]:
customers.shape

(206209, 8)

In [22]:
customers.describe()

             user_id            Age   dependenants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [25]:
customers.dtypes

user_id           int64
Gender           object
state            object
Age               int64
date_joined      object
dependenants      int64
family_status    object
income            int64
dtype: object

In [35]:
#check for mixed data types, no mixed data types
for col in customers.columns.tolist():
  weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

In [26]:
#Gender - perfect column, no other values
customers['Gender'].value_counts(dropna = False)

Male      104067
Female    102142
Name: Gender, dtype: int64

In [27]:
#state - no data problems here
#a little weird that there's almost exactly the same values for every state
customers['state'].value_counts(dropna = False)

Florida                 4044
Colorado                4044
Illinois                4044
Alabama                 4044
District of Columbia    4044
Hawaii                  4044
Arizona                 4044
Connecticut             4044
California              4044
Indiana                 4044
Arkansas                4044
Alaska                  4044
Delaware                4044
Iowa                    4044
Idaho                   4044
Georgia                 4044
Wyoming                 4043
Mississippi             4043
Oklahoma                4043
Utah                    4043
New Hampshire           4043
Kentucky                4043
Maryland                4043
Rhode Island            4043
Massachusetts           4043
Michigan                4043
New Jersey              4043
Kansas                  4043
South Dakota            4043
Minnesota               4043
Tennessee               4043
New York                4043
Washington              4043
Louisiana               4043
Montana                 4043
North Dakota            4043
Wisconsin               4043
Nebraska                4043
Vermont                 4043
Nevada                  4043
Maine                   4043
North Carolina          4043
West Virginia           4043
Virginia                4043
Oregon                  4043
New Mexico              4043
Texas                   4043
Pennsylvania            4043
Ohio                    4043
South Carolina          4043
Missouri                4043
Name: state, dtype: int64

In [29]:
#age - doesn't seem like there's any issue
customers['Age'].value_counts(dropna = False)

19    3329
55    3317
51    3317
56    3306
32    3305
      ...
65    3145
25    3127
66    3114
50    3102
36    3101
Name: Age, Length: 64, dtype: int64

In [30]:
#date_joined
customers['date_joined'].value_counts(dropna = False)

9/17/2018     213
2/10/2018     212
4/1/2019      211
9/21/2019     211
12/19/2017    210
             ...
9/1/2018      141
1/22/2018     140
11/24/2017    139
7/18/2019     138
8/6/2018      128
Name: date_joined, Length: 1187, dtype: int64

In [31]:
#dependenants - no NAs
customers['dependenants'].value_counts(dropna = False)

0    51602
3    51594
1    51531
2    51482
Name: dependenants, dtype: int64

In [32]:
#family_status - no Nas
customers['family_status'].value_counts(dropna = False)

married                             144906
single                               33962
divorced/widowed                     17640
living with parents and siblings      9701
Name: family_status, dtype: int64

In [33]:
#income - think it's good 
customers['income'].value_counts(dropna = False)

57192     10
95891     10
95710     10
97532      9
98675      9
          ..
73141      1
71524      1
74408      1
44780      1
148828     1
Name: income, Length: 108012, dtype: int64

In [36]:
#checking for null values, there are no null values
customers.isnull().sum()

user_id          0
Gender           0
state            0
Age              0
date_joined      0
dependenants     0
family_status    0
income           0
dtype: int64

In [40]:
# checking for duplicates, there are no duplicates
customers[customers.duplicated()]

Empty DataFrame
Columns: [user_id, Gender, state, Age, date_joined, dependenants, family_status, income]
Index: []

In [43]:
customers.head()

,user_id,Gender,state,Age,date_joined,dependenants,family_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

In [41]:
#importing the most recent prepared instacart data
merged = pd.read_pickle(os.path.join(path,'02 Data','prepared data','ords_prods_freq_flags.pkl'))

In [52]:
merged.columns

Index(['order_id', 'user_id', 'order_number', 'order_dow', 'order_hour_of_day',
       'days_since_prior_order', 'first_order', 'product_id',
       'add_to_cart_order', 'reordered', '_merge', 'product_name', 'aisle_id',
       'department_id', 'prices', 'price_range_loc', 'busiest day',
       'Busiest 2 Days', 'busiest_period_of_day', 'max_order', 'loyalty_flag',
       'user_avg', 'spender_flag', 'order_freq', 'freq_flag'],
      dtype='object')

In [48]:
customers.dtypes

user_id           int64
Gender           object
state            object
Age               int64
date_joined      object
dependenants      int64
family_status    object
income            int64
dtype: object

In [54]:
#merging customers with the other prepared dfs
combo = customers.merge(merged,on = ['user_id'], how = 'inner')

In [55]:
combo.head()

,user_id,Gender,state,Age,date_joined,dependenants,family_status,income,order_id,order_number,...,price_range_loc,busiest day,Busiest 2 Days,busiest_period_of_day,max_order,loyalty_flag,user_avg,spender_flag,order_freq,freq_flag
0,26711,Female,Missouri,48,1/1/2017,3,married,165665,2543867,5,...,Mid-range product,Regularly busy,Busiest 2 days,Most orders,8,New customer,7.988889,Low spender,19.0,Regular customer
1,26711,Female,Missouri,48,1/1/2017,3,married,165665,1285508,7,...,Mid-range product,Regularly busy,Regulary busy,Most orders,8,New customer,7.988889,Low spender,19.0,Regular customer
2,26711,Female,Missouri,48,1/1/2017,3,married,165665,2578584,8,...,Mid-range product,Regularly busy,Busiest 2 days,Most orders,8,New customer,7.988889,Low spender,19.0,Regular customer
3,26711,Female,Missouri,48,1/1/2017,3,married,165665,423547,2,...,Mid-range product,Regularly busy,Regulary busy,Most orders,8,New customer,7.988889,Low spender,19.0,Regular customer
4,26711,Female,Missouri,48,1/1/2017,3,married,165665,2524893,3,...,Mid-range product,Regularly busy,Least busy 2,Most orders,8,New customer,7.988889,Low spender,19.0,Regular customer

In [56]:
combo.columns

Index(['user_id', 'Gender', 'state', 'Age', 'date_joined', 'dependenants',
       'family_status', 'income', 'order_id', 'order_number', 'order_dow',
       'order_hour_of_day', 'days_since_prior_order', 'first_order',
       'product_id', 'add_to_cart_order', 'reordered', '_merge',
       'product_name', 'aisle_id', 'department_id', 'prices',
       'price_range_loc', 'busiest day', 'Busiest 2 Days',
       'busiest_period_of_day', 'max_order', 'loyalty_flag', 'user_avg',
       'spender_flag', 'order_freq', 'freq_flag'],
      dtype='object')

In [57]:
#saving the dataframe as a pickle
combo.to_pickle(os.path.join(path,'02 Data','prepared data','cust_ord_prods.pkl'))